ws-base/src/test/resources/unitTest/repositoryServiceGetNode.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ws="http://www.caib.es/gdib/repository/ws">
	<soapenv:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			mustUnderstand="1">
			<wsse:UsernameToken
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				wsu:Id="UsernameToken-1">
				<wsse:Username>admin</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">admin</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ws:getNode>
			<nodeId>aaa</nodeId>
			<withContent>false</withContent>
			<withSign>false</withSign>
			<gdibHeader>
				<applicant>
					<name>solicitanteNombre</name>
					<document>solicitanteDocumento</document>
				</applicant>
				<functionary>
					<name>funcionarioNombre</name>
					<document>funcionarioDocumento</document>
					<tramitadoraUnit>unidadTramitadora</tramitadoraUnit>
				</functionary>
				<expedient>
					<number>numeroExpediente</number>
					<procedure>procedimientoExpediente</procedure>
				</expedient>
				<application>aplicacion</application>
				<documentarySeries>serieDocumental</documentarySeries>
				<operationEsb>operaionESB</operationEsb>
			</gdibHeader>
		</ws:getNode>
	</soapenv:Body>
</soapenv:Envelope>